import React from 'react'

class Words extends React.Component {
    render() {
        const pStyle = { padding: 12 }
        return (
            <div style={{ padding: 24 }}>
                <h1 style={{ textIndent: 0, color: '#515151', fontSize: 18, fontWeight: 'bold' }}>企业介绍</h1>
                <h2 style={{ textIndent: 0, color: '#BBBFC2', fontSize: 15 }}>General General</h2>
                <img style={{ float: 'left', margin: 10, width: 250 }} src="/words.jpg" />
                <p style={pStyle}>
                    狼人（Werewolf）是西方民间传说的一种兽人，其形象被广泛的应用于各种科幻题材之中。狼人极度惧怕「银」，厌恶任何由银制的物品，只是皮肤表面的接触也会让它们感到疼痛，这可用作分辨它们与普通人的方法。
                    “即便一个心地纯洁的人，一个不忘在夜间祈祷的人，也难免在乌头草盛开的月圆之夜变身为狼。” 关于狼人的传说自古以来络绎不绝。
                    近半个世纪以来，狼人无疑已经成为西方神秘文化中最热门的话题之一，这种怪物平时从外表上看与常人并无不同，但一到月圆之夜就会变身为狼人，失去理性并变的狂暴。
                    在现代有许多影视作品，常常将吸血鬼(Vampire)与狼人联系起来，将它们作为彼此的宿敌，但和吸血鬼那如深渊一般深不可测形象不同，狼人的形象往往是残忍、嗜血的屠夫和忠诚、勇猛的战士两者的结合。
                </p>
                <p style={pStyle}>
                    狼人（Werewolf）是西方民间传说的一种兽人，其形象被广泛的应用于各种科幻题材之中。狼人极度惧怕「银」，厌恶任何由银制的物品，只是皮肤表面的接触也会让它们感到疼痛，这可用作分辨它们与普通人的方法。
                    “即便一个心地纯洁的人，一个不忘在夜间祈祷的人，也难免在乌头草盛开的月圆之夜变身为狼。” 关于狼人的传说自古以来络绎不绝。
                    近半个世纪以来，狼人无疑已经成为西方神秘文化中最热门的话题之一，这种怪物平时从外表上看与常人并无不同，但一到月圆之夜就会变身为狼人，失去理性并变的狂暴。
                    在现代有许多影视作品，常常将吸血鬼(Vampire)与狼人联系起来，将它们作为彼此的宿敌，但和吸血鬼那如深渊一般深不可测形象不同，狼人的形象往往是残忍、嗜血的屠夫和忠诚、勇猛的战士两者的结合。
                </p>
                <p style={pStyle}>
                    狼人（Werewolf）是西方民间传说的一种兽人，其形象被广泛的应用于各种科幻题材之中。狼人极度惧怕「银」，厌恶任何由银制的物品，只是皮肤表面的接触也会让它们感到疼痛，这可用作分辨它们与普通人的方法。
                    “即便一个心地纯洁的人，一个不忘在夜间祈祷的人，也难免在乌头草盛开的月圆之夜变身为狼。” 关于狼人的传说自古以来络绎不绝。
                    近半个世纪以来，狼人无疑已经成为西方神秘文化中最热门的话题之一，这种怪物平时从外表上看与常人并无不同，但一到月圆之夜就会变身为狼人，失去理性并变的狂暴。
                    在现代有许多影视作品，常常将吸血鬼(Vampire)与狼人联系起来，将它们作为彼此的宿敌，但和吸血鬼那如深渊一般深不可测形象不同，狼人的形象往往是残忍、嗜血的屠夫和忠诚、勇猛的战士两者的结合。
                </p>
                <p style={pStyle}>
                    狼人（Werewolf）是西方民间传说的一种兽人，其形象被广泛的应用于各种科幻题材之中。狼人极度惧怕「银」，厌恶任何由银制的物品，只是皮肤表面的接触也会让它们感到疼痛，这可用作分辨它们与普通人的方法。
                    “即便一个心地纯洁的人，一个不忘在夜间祈祷的人，也难免在乌头草盛开的月圆之夜变身为狼。” 关于狼人的传说自古以来络绎不绝。
                    近半个世纪以来，狼人无疑已经成为西方神秘文化中最热门的话题之一，这种怪物平时从外表上看与常人并无不同，但一到月圆之夜就会变身为狼人，失去理性并变的狂暴。
                    在现代有许多影视作品，常常将吸血鬼(Vampire)与狼人联系起来，将它们作为彼此的宿敌，但和吸血鬼那如深渊一般深不可测形象不同，狼人的形象往往是残忍、嗜血的屠夫和忠诚、勇猛的战士两者的结合。
                </p>
            </div>
        )
    }
}

export default Words;